# vim:ft=ruby

if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"
    tap "homebrew/cask-versions"

    brew "mas" # Mac App Store CLI
    brew "noti" # utility to display notifications from scripts
    brew "trash" # rm, but put in the trash rather than completely delete

    # Applications from Cask
    cask "wezterm" # a better terminal emulator
    cask "imageoptim" # a tool to optimize images
    cask "1password" # 1password
    cask "1password-cli" # 1password cli
    cask "raycast" # better spotlight instead of alfred
    cask "caffeine" # prevent sleep
    cask "docker" # Docker
    cask "firefox-developer-edition" # Firefox Developer Edition
    cask "google-chrome" # Google Chrome
    cask "visual-studio-code" # Visual Studio Code
    cask "vlc" # VLC for better video playback
    cask "coconutbattery" # battery status
    cask "spotify" # Spotify
    cask "protonvpn" # ProtonVPN
    cask "gswitch" # switch between graphics cards
    cask "betterdisplay" # better external displays support
    cask "gpg-suite-no-mail" # GPG Suite
    cask "discord" # Discord

    # Applications from App Store
    mas "magnet", id: 441258766 # Magnet window manager
    mas "colorslurp", id: 1287239339 # ColorSlurp for color picking

    # Fonts
    cask "font-fira-code"
    cask "font-fira-code-nerd-font"
    cask "font-jetbrains-mono"
    cask "font-jetbrains-mono-nerd-font"
elsif OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "exa" # better ls
brew "bat" # better cat
brew "cloc" # lines of code counter
brew "git-delta" # a better git diff
brew "entr" # file watcher / command runner
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "coreutils" # GNU core utilities (latest)
brew "curl" # curl (latest)
brew "git" # Git version control (latest version)
brew "glow" # markdown viewer
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "neofetch" # pretty system info
brew "neovim" # A better vim
brew "helix" # a better editor
brew "python" # python (latest)
brew "ripgrep" # very fast file searcher
brew "asdf" # tooling version manager
brew "shellcheck" # diagnostics for shell sripts
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "vim" # Vim (latest)
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever
brew "z" # switch between most used directories
brew "zsh" # zsh (latest)
brew "sheldon" # shell plugin manager
